Repository: flipper-hero/ios-app
Catalog: Sources/AgentKit/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, pl, pt_br, ru, tr, uk, zh_hans

source: medium-risk changes would no longer ask you
ar: لن تطلب التغييرات متوسطة الخطورة موافقتك بعد الآن
de: Änderungen mit mittlerem Risiko würden nicht mehr nachfragen
es: los cambios de riesgo medio ya no te preguntarían
fr: les modifications à risque moyen ne te demanderaient plus rien
hi: मध्यम जोखिम वाले बदलाव अब आपसे नहीं पूछेंगे
it: le modifiche a rischio medio non chiederebbero più conferma
ja: 中リスクの変更で確認されなくなります
ko: 중간 위험 변경에서 더 이상 묻지 않게 됩니다
pl: zmiany średniego ryzyka przestałyby pytać
pt_br: mudanças de risco médio não perguntariam mais
ru: изменения среднего риска больше не будут требовать подтверждения
tr: orta riskli değişiklikler artık sana sormaz
uk: зміни середнього ризику більше не потребуватимуть підтвердження
zh_hans: 中风险更改将不再询问你

source: moves a file
ar: ينقل ملفًا
de: verschiebt eine Datei
es: mueve un archivo
fr: déplace un fichier
hi: एक फ़ाइल ले जाता है
it: sposta un file
ja: ファイルを移動します
ko: 파일을 이동합니다
pl: przenosi plik
pt_br: move um arquivo
ru: перемещает файл
tr: bir dosyayı taşır
uk: переміщує файл
zh_hans: 移动文件

source: presses buttons in whatever app is open, which can start transmissions or delete data
ar: يضغط أزرارًا في التطبيق المفتوح، مما قد يبدأ إرسالًا أو يحذف بيانات
de: drückt Tasten in der gerade offenen App, was Übertragungen starten oder Daten löschen kann
es: pulsa botones en la app abierta, lo que puede iniciar transmisiones o borrar datos
fr: appuie sur des boutons dans l’app ouverte, ce qui peut lancer des émissions ou supprimer des données
hi: खुले हुए ऐप में बटन दबाता है, जिससे प्रसारण शुरू हो सकता है या डेटा हट सकता है
it: preme tasti nell’app aperta, il che può avviare trasmissioni o eliminare dati
ja: 開いているアプリでボタンを押します。送信の開始やデータの削除につながる可能性があります
ko: 열려 있는 앱에서 버튼을 누릅니다. 전송을 시작하거나 데이터를 삭제할 수 있습니다
pl: naciska przyciski w otwartej aplikacji, co może rozpocząć nadawanie lub usunąć dane
pt_br: pressiona botões no app aberto, o que pode iniciar transmissões ou apagar dados
ru: нажимает кнопки в открытом приложении, что может запустить передачу или удалить данные
tr: açık olan uygulamada tuşlara basar; bu gönderim başlatabilir veya veri silebilir
uk: натискає кнопки у відкритому застосунку, що може запустити передавання або видалити дані
zh_hans: 在当前打开的应用中按键，可能会开始发射或删除数据

source: protected path
ar: مسار محمي
de: geschützter Pfad
es: ruta protegida
fr: chemin protégé
hi: संरक्षित पथ
it: percorso protetto
ja: 保護されたパス
ko: 보호된 경로
pl: chroniona ścieżka
pt_br: caminho protegido
ru: защищённый путь
tr: korumalı yol
uk: захищений шлях
zh_hans: 受保护的路径

source: protected path (internal storage)
ar: مسار محمي (التخزين الداخلي)
de: geschützter Pfad (interner Speicher)
es: ruta protegida (almacenamiento interno)
fr: chemin protégé (stockage interne)
hi: संरक्षित पथ (आंतरिक स्टोरेज)
it: percorso protetto (memoria interna)
ja: 保護されたパス（内部ストレージ）
ko: 보호된 경로 (내부 저장소)
pl: chroniona ścieżka (pamięć wewnętrzna)
pt_br: caminho protegido (armazenamento interno)
ru: защищённый путь (внутренняя память)
tr: korumalı yol (dahili depolama)
uk: захищений шлях (внутрішня пам’ять)
zh_hans: 受保护的路径（内部存储）

source: puts %@ on GPIO pin %@
ar: يضع %@ على طرف GPIO %@
de: legt %@ an GPIO-Pin %@ an
es: pone %@ en el pin GPIO %@
fr: applique %@ sur la broche GPIO %@
hi: GPIO पिन %@ पर %@ लगाता है
it: mette %@ sul pin GPIO %@
ja: GPIO ピン %@ に %@ を出力します
ko: GPIO 핀 %@에 %@를 출력합니다
pl: podaje %@ na pin GPIO %@
pt_br: aplica %@ no pino GPIO %@
ru: подаёт %@ на вывод GPIO %@
tr: GPIO %@ pinine %@ uyguluyor
uk: подає %@ на вивід GPIO %@
zh_hans: 将 %@ 施加到 GPIO 引脚 %@

source: raw device commands can reach anything the firmware exposes
ar: الأوامر الخام يمكن أن تصل إلى كل ما تكشفه الثابتة
de: rohe Gerätebefehle erreichen alles, was die Firmware bereitstellt
es: los comandos sin procesar pueden llegar a todo lo que expone el firmware
fr: les commandes brutes peuvent atteindre tout ce que le firmware expose
hi: कच्चे डिवाइस कमांड फर्मवेयर की दी हुई हर चीज़ तक पहुँच सकते हैं
it: i comandi grezzi possono raggiungere tutto ciò che il firmware espone
ja: 生のデバイスコマンドはファームウェアが公開するすべてに届きます
ko: 원시 장치 명령은 펌웨어가 노출하는 모든 것에 닿을 수 있습니다
pl: surowe polecenia urządzenia mogą sięgnąć wszystkiego, co udostępnia firmware
pt_br: comandos brutos podem alcançar tudo que o firmware expõe
ru: сырые команды могут достать всё, что открывает прошивка
tr: ham cihaz komutları aygıt yazılımının açtığı her şeye ulaşabilir
uk: сирі команди можуть сягати всього, що відкриває прошивка
zh_hans: 原始设备命令可以访问固件暴露的一切

source: read-only
ar: للقراءة فقط
de: nur lesend
es: solo lectura
fr: lecture seule
hi: केवल पढ़ने के लिए
it: sola lettura
ja: 読み取り専用
ko: 읽기 전용
pl: tylko odczyt
pt_br: somente leitura
ru: только чтение
tr: salt okunur
uk: лише читання
zh_hans: 只读

source: reading key or secret files is not allowed
ar: قراءة ملفات المفاتيح أو الأسرار غير مسموحة
de: das Lesen von Schlüssel- oder Geheimnisdateien ist nicht erlaubt
es: no se permite leer archivos de claves o secretos
fr: la lecture de fichiers de clés ou de secrets n’est pas autorisée
hi: कुंजी या गुप्त फ़ाइलें पढ़ने की अनुमति नहीं है
it: la lettura di file di chiavi o segreti non è consentita
ja: キーや秘密情報のファイルは読み取れません
ko: 키 또는 비밀 파일은 읽을 수 없습니다
pl: odczyt plików kluczy i sekretów jest niedozwolony
pt_br: ler arquivos de chaves ou segredos não é permitido
ru: чтение файлов ключей и секретов запрещено
tr: anahtar veya gizli dosyaları okumaya izin verilmiyor
uk: читання файлів ключів і секретів заборонено
zh_hans: 不允许读取密钥或机密文件

source: reads GPIO pin %@, changes nothing
ar: يقرأ طرف GPIO %@، دون أي تغيير
de: liest GPIO-Pin %@, ändert nichts
es: lee el pin GPIO %@, no cambia nada
fr: lit la broche GPIO %@, ne change rien
hi: GPIO पिन %@ पढ़ता है, कुछ नहीं बदलता
it: legge il pin GPIO %@, non cambia nulla
ja: GPIO ピン %@ を読み取ります。変更はしません
ko: GPIO 핀 %@를 읽습니다. 변경은 없습니다
pl: odczytuje pin GPIO %@, nic nie zmienia
pt_br: lê o pino GPIO %@, não muda nada
ru: читает вывод GPIO %@, ничего не меняет
tr: GPIO %@ pinini okuyor, hiçbir şeyi değiştirmiyor
uk: читає вивід GPIO %@, нічого не змінює
zh_hans: 读取 GPIO 引脚 %@，不做任何更改

source: reads the device inventory
ar: يقرأ جرد الجهاز
de: liest den Bestand des Geräts
es: lee el inventario del dispositivo
fr: lit l’inventaire de l’appareil
hi: डिवाइस की सूची पढ़ता है
it: legge l’inventario del dispositivo
ja: デバイスの内容一覧を読み取ります
ko: 기기 목록을 읽습니다
pl: odczytuje zawartość urządzenia
pt_br: lê o inventário do dispositivo
ru: читает список содержимого устройства
tr: aygıtın envanterini okur
uk: читає перелік вмісту пристрою
zh_hans: 读取设备清单

source: reconfigures GPIO pin %@ on the expansion header
ar: يعيد ضبط طرف GPIO %@ على رأس التوسعة
de: konfiguriert GPIO-Pin %@ am Erweiterungs-Header um
es: reconfigura el pin GPIO %@ del conector de expansión
fr: reconfigure la broche GPIO %@ du connecteur d'extension
hi: एक्सपेंशन हेडर पर GPIO पिन %@ को फिर से कॉन्फ़िगर करता है
it: riconfigura il pin GPIO %@ del connettore di espansione
ja: 拡張ヘッダーの GPIO ピン %@ を再設定します
ko: 확장 헤더의 GPIO 핀 %@를 재구성합니다
pl: przekonfigurowuje pin GPIO %@ na złączu rozszerzeń
pt_br: reconfigura o pino GPIO %@ do conector de expansão
ru: перенастраивает вывод GPIO %@ на разъёме расширения
tr: genişleme başlığındaki GPIO %@ pinini yeniden yapılandırıyor
uk: переналаштовує вивід GPIO %@ на роз'ємі розширення
zh_hans: 重新配置扩展排针上的 GPIO 引脚 %@

source: refusing recursive delete of a top-level folder
ar: رفض الحذف المتكرر لمجلد في المستوى الأعلى
de: rekursives Löschen eines obersten Ordners wird verweigert
es: se rechaza el borrado recursivo de una carpeta principal
fr: suppression récursive d’un dossier racine refusée
hi: शीर्ष-स्तरीय फ़ोल्डर का रिकर्सिव डिलीट अस्वीकार
it: eliminazione ricorsiva di una cartella principale rifiutata
ja: 最上位フォルダの再帰削除は拒否されます
ko: 최상위 폴더의 재귀 삭제는 거부됩니다
pl: odmowa rekurencyjnego usunięcia folderu głównego
pt_br: exclusão recursiva de pasta principal recusada
ru: рекурсивное удаление папки верхнего уровня запрещено
tr: üst düzey bir klasörün yinelemeli silinmesi reddedildi
uk: рекурсивне видалення папки верхнього рівня заборонено
zh_hans: 拒绝递归删除顶层文件夹

source: removes the protection against instructions planted in files on the Flipper
ar: يزيل الحماية من التعليمات المدسوسة في ملفات على Flipper
de: entfernt den Schutz vor Anweisungen, die in Dateien auf dem Flipper versteckt sind
es: elimina la protección contra instrucciones ocultas en archivos del Flipper
fr: supprime la protection contre les instructions cachées dans des fichiers du Flipper
hi: Flipper की फ़ाइलों में छिपाए गए निर्देशों से सुरक्षा हटाता है
it: rimuove la protezione contro istruzioni nascoste nei file del Flipper
ja: Flipper 上のファイルに仕込まれた指示への保護を外します
ko: Flipper 파일에 심어진 지시에 대한 보호를 해제합니다
pl: usuwa ochronę przed instrukcjami ukrytymi w plikach na Flipperze
pt_br: remove a proteção contra instruções plantadas em arquivos do Flipper
ru: снимает защиту от инструкций, спрятанных в файлах на Flipper
tr: Flipper’daki dosyalara gizlenmiş talimatlara karşı korumayı kaldırır
uk: знімає захист від інструкцій, прихованих у файлах на Flipper
zh_hans: 移除对 Flipper 文件中植入指令的防护

source: replaces the firmware; takes 15 to 25 minutes and the Flipper restarts
ar: يستبدل البرنامج الثابت؛ يستغرق من 15 إلى 25 دقيقة ويعيد Flipper التشغيل
de: ersetzt die Firmware; dauert 15 bis 25 Minuten und der Flipper startet neu
es: reemplaza el firmware; tarda de 15 a 25 minutos y el Flipper se reinicia
fr: remplace le firmware ; prend 15 à 25 minutes et le Flipper redémarre
hi: फ़र्मवेयर बदलता है; 15 से 25 मिनट लगते हैं और Flipper रीस्टार्ट होता है
it: sostituisce il firmware; richiede dai 15 ai 25 minuti e il Flipper si riavvia
ja: ファームウェアを置き換えます。15〜25 分かかり、Flipper が再起動します
ko: 펌웨어를 교체합니다. 15~25분이 걸리며 Flipper가 재시동합니다
pl: zastępuje firmware; trwa 15–25 minut, a Flipper uruchomi się ponownie
pt_br: substitui o firmware; leva de 15 a 25 minutos e o Flipper reinicia
ru: заменяет прошивку; занимает 15–25 минут, Flipper перезагрузится
tr: aygıt yazılımını değiştirir; 15 ila 25 dakika sürer ve Flipper yeniden başlar
uk: замінює прошивку; триває 15–25 хвилин, Flipper перезапуститься
zh_hans: 替换固件；需要 15 到 25 分钟，Flipper 会重启

source: restarts the Flipper; whatever runs on it stops and the connection drops briefly
ar: يعيد تشغيل Flipper؛ يتوقف ما يعمل عليه وينقطع الاتصال لفترة وجيزة
de: startet den Flipper neu; was darauf läuft, wird beendet und die Verbindung bricht kurz ab
es: reinicia el Flipper; lo que se ejecuta se detiene y la conexión se corta brevemente
fr: redémarre le Flipper ; ce qui tourne dessus s’arrête et la connexion coupe brièvement
hi: Flipper रीस्टार्ट करता है; उस पर जो चल रहा है वह रुकता है और कनेक्शन थोड़ी देर टूटता है
it: riavvia il Flipper; ciò che è in esecuzione si ferma e la connessione cade per un attimo
ja: Flipper を再起動します。実行中のものは停止し、接続が一時的に切れます
ko: Flipper를 재시동합니다. 실행 중인 것이 중지되고 연결이 잠시 끊깁니다
pl: uruchamia Flippera ponownie; wszystko, co działa, zostanie zatrzymane, a połączenie na chwilę zniknie
pt_br: reinicia o Flipper; o que estiver rodando para e a conexão cai por um instante
ru: перезагружает Flipper; всё запущенное остановится, соединение ненадолго пропадёт
tr: Flipper’ı yeniden başlatır; üzerinde çalışan her şey durur ve bağlantı kısa süre kopar
uk: перезапускає Flipper; усе запущене зупиниться, з’єднання ненадовго зникне
zh_hans: 重启 Flipper；正在运行的内容会停止，连接会短暂中断

source: searches the internet, changes nothing
ar: يبحث في الإنترنت، ولا يغيّر شيئًا
de: sucht im Internet, ändert nichts
es: busca en internet, no cambia nada
fr: cherche sur Internet, ne modifie rien
hi: इंटरनेट पर खोजता है, कुछ नहीं बदलता
it: cerca su internet, non modifica nulla
ja: インターネットを検索します。何も変更しません
ko: 인터넷을 검색하며 아무것도 바꾸지 않습니다
pl: szuka w internecie, niczego nie zmienia
pt_br: busca na internet, não muda nada
ru: ищет в интернете, ничего не меняет
tr: internette arar, hiçbir şeyi değiştirmez
uk: шукає в інтернеті, нічого не змінює
zh_hans: 搜索互联网，不做任何更改

source: sends a raw device command that bypasses the normal tool checks
ar: يرسل أمر جهاز خام يتجاوز الفحوص العادية للأدوات
de: sendet einen rohen Gerätebefehl, der die normalen Werkzeugprüfungen umgeht
es: envía un comando sin procesar que se salta las comprobaciones normales de las herramientas
fr: envoie une commande brute qui contourne les vérifications normales des outils
hi: सामान्य टूल जाँचों को छोड़कर एक कच्चा डिवाइस कमांड भेजता है
it: invia un comando grezzo che aggira i normali controlli degli strumenti
ja: 通常のツール検査を素通りする生のデバイスコマンドを送信します
ko: 일반 도구 검사를 우회하는 원시 장치 명령을 보냅니다
pl: wysyła surowe polecenie urządzenia z pominięciem zwykłych kontroli narzędzi
pt_br: envia um comando bruto que ignora as verificações normais das ferramentas
ru: отправляет сырую команду устройства в обход обычных проверок инструментов
tr: normal araç kontrollerini atlayan ham bir cihaz komutu gönderiyor
uk: надсилає сиру команду пристрою в обхід звичайних перевірок інструментів
zh_hans: 发送绕过常规工具检查的原始设备命令

source: sends an infrared command
ar: يرسل أمر أشعة تحت حمراء
de: sendet einen Infrarot-Befehl
es: envía un comando de infrarrojos
fr: envoie une commande infrarouge
hi: इन्फ़्रारेड कमांड भेजता है
it: invia un comando a infrarossi
ja: 赤外線コマンドを送信します
ko: 적외선 명령을 보냅니다
pl: wysyła polecenie podczerwieni
pt_br: envia um comando infravermelho
ru: отправляет ИК-команду
tr: bir kızılötesi komut gönderir
uk: надсилає ІЧ-команду
zh_hans: 发送红外指令

source: starts an app on the device
ar: يشغّل تطبيقًا على الجهاز
de: startet eine App auf dem Gerät
es: abre una app en el dispositivo
fr: lance une app sur l’appareil
hi: डिवाइस पर एक ऐप शुरू करता है
it: avvia un’app sul dispositivo
ja: デバイスでアプリを起動します
ko: 기기에서 앱을 실행합니다
pl: uruchamia aplikację na urządzeniu
pt_br: abre um app no dispositivo
ru: запускает приложение на устройстве
tr: aygıtta bir uygulama başlatır
uk: запускає застосунок на пристрої
zh_hans: 在设备上启动应用

source: stops an update before anything is installed
ar: يوقف تحديثًا قبل تثبيت أي شيء
de: stoppt ein Update, bevor etwas installiert wird
es: detiene una actualización antes de instalar nada
fr: arrête une mise à jour avant toute installation
hi: कुछ भी इंस्टॉल होने से पहले अपडेट रोकता है
it: ferma un aggiornamento prima che venga installato qualcosa
ja: 何かがインストールされる前に更新を停止します
ko: 설치되기 전에 업데이트를 중지합니다
pl: zatrzymuje aktualizację, zanim cokolwiek zostanie zainstalowane
pt_br: para uma atualização antes de instalar algo
ru: останавливает обновление до установки
tr: bir güncellemeyi bir şey yüklenmeden durdurur
uk: зупиняє оновлення до встановлення
zh_hans: 在安装任何内容之前停止更新

source: takes a screenshot of the Flipper
ar: يلتقط صورة لشاشة Flipper
de: macht ein Bildschirmfoto vom Flipper
es: hace una captura de la pantalla del Flipper
fr: fait une capture de l’écran du Flipper
hi: Flipper का स्क्रीनशॉट लेता है
it: fa uno screenshot del Flipper
ja: Flipper の画面を撮影します
ko: Flipper 화면을 캡처합니다
pl: robi zrzut ekranu Flippera
pt_br: tira uma captura da tela do Flipper
ru: делает снимок экрана Flipper
tr: Flipper’ın ekran görüntüsünü alır
uk: робить знімок екрана Flipper
zh_hans: 截取 Flipper 的屏幕

source: target can execute code or reconfigure the device
ar: يمكن للهدف تشغيل شيفرة أو إعادة ضبط الجهاز
de: das Ziel kann Code ausführen oder das Gerät umkonfigurieren
es: el destino puede ejecutar código o reconfigurar el dispositivo
fr: la cible peut exécuter du code ou reconfigurer l’appareil
hi: लक्ष्य कोड चला सकता है या डिवाइस को फिर से कॉन्फ़िगर कर सकता है
it: la destinazione può eseguire codice o riconfigurare il dispositivo
ja: 書き込み先でコードの実行やデバイスの再設定が可能です
ko: 대상 위치에서 코드를 실행하거나 기기를 재구성할 수 있습니다
pl: cel może uruchamiać kod lub zmienić konfigurację urządzenia
pt_br: o destino pode executar código ou reconfigurar o dispositivo
ru: цель может выполнять код или перенастраивать устройство
tr: hedef kod çalıştırabilir veya aygıtı yeniden yapılandırabilir
uk: ціль може виконувати код або переналаштовувати пристрій
zh_hans: 目标可以运行代码或重新配置设备

source: the agent could then change, delete and transmit without asking you
ar: قد يغيّر الوكيل حينها ويحذف ويرسل دون أن يسألك
de: der Agent könnte dann ohne Nachfrage ändern, löschen und senden
es: el agente podría cambiar, eliminar y transmitir sin preguntarte
fr: l’agent pourrait alors modifier, supprimer et émettre sans te demander
hi: तब एजेंट आपसे पूछे बिना बदल, हटा और प्रसारित कर सकेगा
it: l’agente potrebbe poi modificare, eliminare e trasmettere senza chiedertelo
ja: エージェントが確認なしで変更、削除、送信できるようになります
ko: 에이전트가 묻지 않고 변경, 삭제, 전송할 수 있게 됩니다
pl: agent mógłby wtedy zmieniać, usuwać i nadawać bez pytania
pt_br: o agente poderia alterar, apagar e transmitir sem perguntar a você
ru: агент сможет изменять, удалять и передавать без вашего подтверждения
tr: ajan o zaman sana sormadan değiştirebilir, silebilir ve gönderebilir
uk: агент зможе змінювати, видаляти й передавати без вашого підтвердження
zh_hans: 智能体之后可以在不询问你的情况下更改、删除和发射

source: the agent runs actions without asking for the rest of the session
ar: الوكيل ينفذ إجراءات دون سؤال لبقية الجلسة
de: der Agent führt in der restlichen Sitzung Aktionen ohne Nachfragen aus
es: el agente ejecuta acciones sin preguntar por el resto de la sesión
fr: l'agent exécute des actions sans demander pour le reste de la session
hi: एजेंट सेशन भर में बिना पूछे कार्य करता है
it: l'agente esegue azioni senza chiedere per il resto della sessione
ja: このセッションの間、エージェントは確認なしで操作を実行します
ko: 세션이 끝날 때까지 에이전트가 묻지 않고 작업을 실행합니다
pl: agent wykonuje działania bez pytania przez resztę sesji
pt_br: o agente executa ações sem perguntar pelo resto da sessão
ru: агент до конца сессии выполняет действия без запросов
tr: ajan oturumun geri kalanında sormadan işlemler yapıyor
uk: агент до кінця сесії виконує дії без запитів
zh_hans: 智能体在本会话内不再询问即执行操作

source: transmits a radio signal
ar: يرسل إشارة لاسلكية
de: sendet ein Funksignal
es: transmite una señal de radio
fr: émet un signal radio
hi: रेडियो सिग्नल प्रसारित करता है
it: trasmette un segnale radio
ja: 無線信号を送信します
ko: 무선 신호를 보냅니다
pl: nadaje sygnał radiowy
pt_br: transmite um sinal de rádio
ru: передаёт радиосигнал
tr: bir radyo sinyali gönderir
uk: передає радіосигнал
zh_hans: 发射无线电信号

source: types a keystroke-injection script into the connected machine on its own
ar: يكف يكتب نص حقن ضغطات المفاتيح في الجهاز المتصل
de: tippt ein Keystroke-Injection-Skript selbst in die angeschlossene Maschine
es: teclea por su cuenta un script de inyección de teclas en la máquina conectada
fr: tape tout seul un script d'injection de frappe dans la machine connectée
hi: खुद ही जुड़ी मशीन में कीस्ट्रोक-इंजेक्शन स्क्रिप्ट टाइप करता है
it: digita da solo uno script di iniezione tasti nella macchina collegata
ja: 接続先のマシンに自らキーストロークインジェクションスクリプトを入力します
ko: 스스로 연결된 컴퓨터에 키 입력 주입 스크립트를 입력합니다
pl: sam wpisuje skrypt iniekcji klawiszy na podłączoną maszynę
pt_br: digita sozinho um script de injeção de teclas na máquina conectada
ru: сам набирает скрипт инъекции нажатий на подключённой машине
tr: bağlı makineye kendi başına tuş enjeksiyonu betiği yazar
uk: сам набирає скрипт ін'єкції натискань на під'єднаній машині
zh_hans: 自行向所连接的电脑输入按键注入脚本

source: writes a file
ar: يكتب ملفًا
de: schreibt eine Datei
es: escribe un archivo
fr: écrit un fichier
hi: एक फ़ाइल लिखता है
it: scrive un file
ja: ファイルを書き込みます
ko: 파일을 씁니다
pl: zapisuje plik
pt_br: grava um arquivo
ru: записывает файл
tr: bir dosya yazar
uk: записує файл
zh_hans: 写入文件

source: writes a file downloaded from the internet
ar: يكتب ملفًا مُنزَّلًا من الإنترنت
de: schreibt eine aus dem Internet geladene Datei
es: escribe un archivo descargado de internet
fr: écrit un fichier téléchargé depuis Internet
hi: इंटरनेट से डाउनलोड की गई फ़ाइल लिखता है
it: scrive un file scaricato da internet
ja: インターネットからダウンロードしたファイルを書き込みます
ko: 인터넷에서 다운로드한 파일을 씁니다
pl: zapisuje plik pobrany z internetu
pt_br: grava um arquivo baixado da internet
ru: записывает файл, загруженный из интернета
tr: internetten indirilen bir dosya yazar
uk: записує файл, завантажений з інтернету
zh_hans: 写入从互联网下载的文件

source: writes a generated file
ar: يكتب ملفًا مُنشأً
de: schreibt eine erzeugte Datei
es: escribe un archivo generado
fr: écrit un fichier généré
hi: बनाई गई फ़ाइल लिखता है
it: scrive un file generato
ja: 生成したファイルを書き込みます
ko: 생성된 파일을 씁니다
pl: zapisuje wygenerowany plik
pt_br: grava um arquivo gerado
ru: записывает созданный файл
tr: oluşturulmuş bir dosya yazar
uk: записує створений файл
zh_hans: 写入生成的文件
